Revit 2027 API
LinePatternSegment Properties
The LinePatternSegment type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Length |  Gets and sets the length of the segment.
Type |  Gets and sets the type of the segment.
Top
See Also
Reference
LinePatternSegment Class
Autodesk.Revit.DB Namespace